Linjisen/ljs/bk7253_sdk_release_3.2/beken378/ip/mac/mac_frame.h
// VHT Capability IE
#define MAC_VHT_CAPA_ELMT_LEN                   12
#define MAC_VHT_CAPA_ELMT_LEN_WD               (CO_ALIGN4_HI(MAC_VHT_CAPA_ELMT_LEN) / 4)
#define MAC_VHT_CAPA_LEN                        14
#define MAC_VHT_CAPA_ID_OFT                     0
#define MAC_VHT_CAPA_LEN_OFT                    1
#define MAC_VHT_CAPA_INFO_OFT                   2
#define MAC_VHT_RX_MCS_MAP_OFT                  6
#define MAC_VHT_RX_HIGHEST_RATE_OFT             8
#define MAC_VHT_TX_MCS_MAP_OFT                  10
#define MAC_VHT_TX_HIGHEST_RATE_OFT             12

// VHT Operation IE
#define MAC_VHT_OPER_ELMT_LEN                   5
#define MAC_VHT_OPER_ID_OFT                     0
#define MAC_VHT_OPER_LEN_OFT                    1
#define MAC_VHT_CHAN_WIDTH_OFT                  2
#define MAC_VHT_CENTER_FREQ0_OFT                3
#define MAC_VHT_CENTER_FREQ1_OFT                4
#define MAC_VHT_BASIC_MCS_OFT                   5

// 20/40 Coexistence IE
#define MAC_20_40_COEXISTENCE_ID_OFT                0
#define MAC_20_40_COEXISTENCE_LEN_OFT               1
#define MAC_20_40_COEXISTENCE_INFO_OFT              2
#define MAC_20_40_COEXISTENCE_ELMT_LEN              1
#define MAC_20_40_COEXISTENCE_LEN                   3
#define MAC_20_40_COEXISTENCE_INFO_REQ_MASK         0x01
#define MAC_20_40_COEXISTENCE_40_INTOLERANT_MASK    0x02
#define MAC_20_40_COEXISTENCE_20_BSS_WIDTH_REQ_MASK 0x04
#define MAC_20_40_COEXISTENCE_OBSS_SCAN_REQ_MASK    0x08
#define MAC_20_40_COEXISTENCE_OBSS_SCAN_GRANT_MASK  0x10

// Mgmt MIC IE
#define MAC_MGMT_MIC_ID_OFT    0
#define MAC_MGMT_MIC_LEN_OFT   1
#define MAC_MGMT_MIC_KEYID_OFT 2
#define MAC_MGMT_MIC_IPN_OFT   4
#define MAC_MGMT_MIC_IPN_LEN   6
#define MAC_MGMT_MIC_MIC_OFT   10
#define MAC_MGMT_MIC_MIC_LEN   8
#define MAC_MGMT_MIC_LEN       18

// QOS INFORMATION FIELD
#define MAC_QINFO_OFT                           6

// QOS INFORMATION FIELD received from the AP
#define MAC_QINFO_SET_COUNT_OFT                 8
#define MAC_QINFO_SET_UAPSD_OFT                 8

// Bit position for QOS INFORMATION FEILD received from the AP
#define MAC_QINFO_SET_COUNT                     0x07   // Bits 0,1,2
#define MAC_QINFO_SET_UAPSD                     0x80   // Bit 7

#define SUP_MCS_RX_HIGHEST_RATE_OFT             10 // 10,11th Byte from Start of MCS.
#define SUP_MCS_RX_HIGHEST_RATE_SIZE            10 // 10 Bits
#define SUP_TX_MCS_SET_OFT                      12 // 12th Byte from Start of MCS.

/*
* MANAGEMENT FRAME DESCRIPTION
****************************************************************************************
*/
#define MAC_BEACON_MAX_LEN              333
#define MAC_BEACONINFO_SIZE              78   // size without TIM
#define MAC_TIM_SIZE                    251   // max TIM size
// Attention, in a non-AP STA the IBSS
// parameter set is stored in place of
// the TIM -> min size 4

#define MAC_BEACON_HDR_LEN               36

/*
 * Beacon Frame offset (Table 5 p46)
 */
#define MAC_BEACON_TIMESTAMP_OFT          MAC_SHORT_MAC_HDR_LEN   // Order 1
#define MAC_BEACON_INTERVAL_OFT          (MAC_SHORT_MAC_HDR_LEN + 8)   // Order 2
#define MAC_BEACON_CAPA_OFT              (MAC_SHORT_MAC_HDR_LEN + 10)   // Order 3
#define MAC_BEACON_VARIABLE_PART_OFT     (MAC_SHORT_MAC_HDR_LEN + 12)   // Order 4

#define BEACON_CAP_ESS	    0x0001
#define BEACON_CAP_IBSS	    0x0002
#define BEACON_CAP_PRIVACY	0x0010
#define BEACON_CAP_RRM	    0x1000


/*
 * Probe Request Frame offset
 */
#define MAC_PROBEREQ_SSID_OFT             0   // Order 1

/*
 * Probe Response Frame offset (Table 12 p49)
 */
#define MAC_PROBE_TIMESTAMP_OFT           0   // Order 1
#define MAC_PROBE_INTERVAL_OFT            8   // Order 2
#define MAC_PROBE_CAPA_OFT               10   // Order 3
#define MAC_PROBE_SSID_OFT               12   // Order 4

/*
 * Authentication Frame offset
 */
#define MAC_AUTH_ALGONBR_OFT              0   // Order 1
#define MAC_AUTH_SEQNBR_OFT               2   // Order 2
#define MAC_AUTH_STATUS_OFT               4   // Order 3
#define MAC_AUTH_CHALLENGE_OFT            6   // Order 4
#define MAC_AUTH_CHALLENGE_LEN          128
//challenge text IE size
#define CHALLENGE_TEXT_SIZE             130

/*
 * Association Req Frame offset
 */
#define MAC_ASSO_REQ_CAPA_OFT             0   // Order 1
#define MAC_ASSO_REQ_LISTEN_OFT           2   // Order 2
#define MAC_ASSO_REQ_SSID_OFT             4   // Order 3

/*
 * Association Rsp Frame offset
 */
#define MAC_ASSO_RSP_CAPA_OFT             0   // Order 1
#define MAC_ASSO_RSP_STATUS_OFT           2   // Order 2
#define MAC_ASSO_RSP_AID_OFT              4   // Order 3
#define MAC_ASSO_RSP_RATES_OFT            6   // Order 4

/*
 * Re association Req Frame offset
 */
#define MAC_REASSO_REQ_CAPA_OFT           0   // Order 1
#define MAC_REASSO_REQ_LISTEN_OFT         2   // Order 2
#define MAC_REASSO_REQ_AP_ADDR_OFT        4   // Order 3
#define MAC_REASSO_REQ_SSID_OFT          10   // Order 4

/*
 * Deauthentication Req Frame offset
 */

#define MAC_DEAUTH_REASON_OFT             0

/*
 * De association Req Frame offset
 */

#define MAC_DISASSOC_REASON_OFT           0
#define MAC_DISASSOC_REASON_LEN           2

/*
 * Category and action for all action frames
 */
#define MAC_ACTION_CATEGORY_OFT           0
#define MAC_ACTION_ACTION_OFT             1
#define MAC_ACTION_TOKEN_OFT              2
#define MAC_ACTION_P2P_ACTION_OFT         5
#define MAC_ACTION_P2P_TAGGED_OFT         7

#define MAC_SPECTRUM_ACTION_CATEGORY        0
#define MAC_WMMAC_QOS_ACTION_CATEGORY       1
#define MAC_DLS_ACTION_CATEGORY             2
#define MAC_BA_ACTION_CATEGORY              3
#define MAC_PUBLIC_ACTION_CATEGORY          4
#define MAC_RADIO_MEASURE_ACTION_CATEGORY   5
#define MAC_FAST_BSS_ACTION_CATEGORY        6
#define MAC_HT_ACTION_CATEGORY              7
#define MAC_SA_QUERY_ACTION_CATEGORY        8
#define MAC_PROT_PUBLIC_ACTION_CATEGORY     9
#define MAC_WNM_ACTION_CATEGORY            10
#define MAC_UNPROT_WNM_ACTION_CATEGORY     11
#define MAC_TDLS_ACTION_CATEGORY           12
#define MAC_MESH_ACTION_CATEGORY           13
#define MAC_MULTIHOP_ACTION_CATEGORY       14
#define MAC_SELF_PROT_ACTION_CATEGORY      15
#define MAC_VHT_ACTION_CATEGORY            21
#define MAC_VENDOR_PROT_ACTION_CATEGORY   126
#define MAC_VENDOR_ACTION_CATEGORY        127
#define MAC_ACTION_CATEGORY_ERROR         128

