Linjisen/ljs/bk7253_sdk_release_3.2/beken378/ip/mac/mac_frame.h
/*
*---------------------------------------------------------------------------------------
*---------------------------------WMM-AC Action Frames----------------------------------
*---------------------------------------------------------------------------------------
*/


/* CATEGORY \ ACTION values
*--------------------------------------------------------------------------------------*/

#define MAC_WMMAC_ACTION_ADDTS_REQ        0
#define MAC_WMMAC_ACTION_ADDTS_RSP        1
#define MAC_WMMAC_ACTION_DELTS            2
#define MAC_WMMAC_ACTION_SCHEDULE         3


/* ADDTS_REQ offsets
*--------------------------------------------------------------------------------------*/

#define MAC_ADDTS_REQ_TSPEC_OFT           3
#define MAC_ADDTS_REQ_TCLASS_OFT         66


/* ADDTS_RSP offsets
*--------------------------------------------------------------------------------------*/

#define MAC_ADDTS_RSP_STATUS_OFT          3
#define MAC_ADDTS_RSP_TSDELAY_OFT         5
#define MAC_ADDTS_RSP_TSPEC_OFT          17
#define MAC_ADDTS_RSP_TCLASS_OFT         80

/* DELTS offsets
*--------------------------------------------------------------------------------------*/

#define MAC_DELTS_TSINFO_OFT              2
#define MAC_DELTS_REASON_OFT             13

/*
*--------------------------------------------------------------------------------------*
*-----------------------------------WMM-AC END------------------------------------------
*--------------------------------------------------------------------------------------*
*/

/*
****************************************************************************************
****************************************************************************************
*----------------------- Block Ack FRAMES AND VALUES DESCRIPTIONS -------------------------
****************************************************************************************
****************************************************************************************
*/

/*
*---------------------------------------------------------------------------------------
*---------------------------------Block Ack fields offsets---------------------------------
*---------------------------------------------------------------------------------------
*/

#define MAC_BARINFO_PERTIDINFO_OFT              0
#define MAC_BARINFO_PERTIDINFO_STEP             1
#define MAC_BARINFO_SEQ_OFT                     2
#define MAC_BARINFO_PERTIDINFO_TID_STEP         4
#define MAC_CAPA_BA_OFT                         14

// the length of fields
#define MAC_BA_PARAMSET_LEN                     2
#define MAC_BA_TIMEOUT_LEN                      2
#define MAC_BA_BARINFO_LEN                      4
#define MAC_BA_DELBA_REASON_LEN                 2

// value of the The Fragment Number
#define MAC_BARINFO_SEQ_FRAG                    0

// offset of The DELPARAMSET
#define MAC_DELPARAMSET_START_OFT               0
#define MAC_DELPARAMSET_STEP_OFT                1

// Bit position for Parameter Set field
#define MAC_BA_PARAMSET_AMSDU_OFT               0
#define MAC_BA_PARAMSET_AMSDU_MASK              CO_BIT(0)

#define MAC_BA_PARAMSET_POLICY_OFT              1
#define MAC_BA_PARAMSET_POLICY_MASK             CO_BIT(1)

#define MAC_BA_PARAMSET_TID_OFT                 2
#define MAC_BA_PARAMSET_TID_MASK                (CO_BIT(2)|CO_BIT(3)|CO_BIT(4)|CO_BIT(5))

#define MAC_BA_PARAMSET_BUFFER_OFT              6
#define MAC_BA_PARAMSET_BUFFER_MASK             0xFFC0

//Bit position for Per TID Info field
#define MAC_BA_BARINFO_PERTIDINFO_TID_OFT       12
#define MAC_BA_BARINFO_PERTIDINFO_TID_MASK  (CO_BIT(12)|CO_BIT(13))|(CO_BIT(14)|CO_BIT(15))

//Bit position for Starting Sequence Control filed
#define MAC_BA_BARINFO_SEQ_FRAG_OFT             0
#define MAC_BA_BARINFO_SEQ_FRAG_MASK        (CO_BIT(0)|CO_BIT(1))|(CO_BIT(2)|CO_BIT(3))

#define MAC_BA_BARINFO_SEQ_STARTSEQ_OFT         4
#define MAC_BA_BARINFO_SEQ_STARTSEQ_MASK        0x7FF0

//Bit position for DELBA Parameter Set field
#define MAC_BA_DELPARAMSET_INIT_OFT             3
#define MAC_BA_DELBARINFO_INIT_MASK             CO_BIT(3)

#define MAC_BA_DELPARAMSET_TID_OFT              4
#define MAC_BA_DELPARAMSET_TID_MASK         (CO_BIT(4)|CO_BIT(5)|CO_BIT(6)|CO_BIT(7))

/*
*---------------------------------------------------------------------------------------
*---------------------------------Block Ack Status Codes-----------------------------------
*---------------------------------------------------------------------------------------
*/
#define MAC_BA_ST_SUCCESS                     0
#define MAC_BA_ST_REQUEST_REFUSED             37
#define MAC_BA_ST_INVALID_PARAMETERS          38

/*
*---------------------------------------------------------------------------------------
*---------------------------------Block Ack Reason Codes-----------------------------------
*---------------------------------------------------------------------------------------
*/
#define MAC_BA_RS_STA_LEAVING                 36
#define MAC_BA_RS_END_BA                      37
#define MAC_BA_RS_UNKNOWN_BA                  38
#define MAC_BA_RS_TIMEOUT                     39

/*
*---------------------------------------------------------------------------------------
*---------------------------------Block Ack Action Frames----------------------------------
*---------------------------------------------------------------------------------------
*/


/* CATEGORY \ ACTION values
*--------------------------------------------------------------------------------------*/

#define MAC_BA_ACTION_ADDBA_REQ         0
#define MAC_BA_ACTION_ADDBA_RSP         1
#define MAC_BA_ACTION_DELBA             2


/* ADDBA_REQ offsets
*--------------------------------------------------------------------------------------*/

#define MAC_ADDBA_REQ_PARAMSET_OFT      3
#define MAC_ADDBA_REQ_TIMEOUT_OFT       5
#define MAC_ADDBA_REQ_BARINFO_OFT       7


/* ADDBA_RSP offsets
*--------------------------------------------------------------------------------------*/

#define MAC_ADDBA_RSP_STATUS_OFT        3
#define MAC_ADDBA_RSP_PARAMSET_OFT      5
#define MAC_ADDBA_RSP_TIMEOUT_OFT       7


/* DELBA offsets
*--------------------------------------------------------------------------------------*/

