Linjisen/ljs/bk7253_sdk_release_3.2/beken378/ip/mac/mac_frame.h
#define MAC_RAW_ENC_RSN_MIXED                                                            \
{{                                                                                       \
    MAC_ELTID_RSN_IEEE, 0x18,                                                            \
    0x01, 0x00,                                 /* version                                                                 */ \
    0x00, 0x0F, 0xAC, MAC_RSNIE_CIPHER_TKIP,    /* group key cipher    (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x02, 0x00,                                 /* pairwise key cipher number                                              */ \
    0x00, 0x0F, 0xAC, MAC_RSNIE_CIPHER_CCMP,    /* pairwise key cipher (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x00, 0x0F, 0xAC, MAC_RSNIE_CIPHER_TKIP,    /* pairwise key cipher (00==none, 01=WEP40, 02==TKIP, 04==CCMP, 05==WEP104)*/ \
    0x01, 0x00,                                 /* authentication key management number                                    */ \
    0x00, 0x0F, 0xAC, MAC_RSNIE_KEYMGT_PSK,     /* authentication key management (01==802.1X auth, 02==PSK)                */ \
    0x00, 0x00                                  /* no pre-authentication capabilities   */                                    \
}}


// Country IE data.
#define MAC_COUNTRY_2G4_FULL      {  3, {'x', 'x', ' '}, { 1, 14, 30}}
#define MAC_COUNTRY_2G4_USA       {  6, {'U', 'S', ' '}, { 1, 11, 30}} // X'10' FCC
#define MAC_COUNTRY_2G4_CANADA    {  6, {'C', 'A', ' '}, { 1, 11, 30}} // X'20' DOC/IC
#define MAC_COUNTRY_2G4_EUROPE    {  6, {'E', 'U', ' '}, { 1, 13, 30}} // X'30' ETSI
#define MAC_COUNTRY_2G4_SPAIN     {  6, {'S', 'P', ' '}, {10,  2, 30}} // X'31'
#define MAC_COUNTRY_2G4_FRANCE    {  6, {'F', 'R', ' '}, {10,  4, 20}} // X'32'
#define MAC_COUNTRY_2G4_JAPAN     {  6, {'J', 'P', ' '}, {14,  1, 30}} // X'40'
#define MAC_COUNTRY_2G4_CHINA     {  6, {'C', 'N', ' '}, { 1, 13, 30}} // X'50'

#define MAC_COUNTRY_5G_FULL       {  3, {'x', 'x', ' '}, {{ 36, 8, 23}}}
#define MAC_COUNTRY_5G_USA        { 18, {'U', 'S', ' '}, {{ 36, 4, 16}, /**/ {52, 4, 23}, /**/ {100, 11, 23}, /**/ {149, 4, 29}, /**/ {165, 1, 30}}}
#define MAC_COUNTRY_5G_FRANCE     { 12, {'F', 'R', ' '}, {{ 36, 4, 23}, /**/ {52, 4, 23}, /**/ {100, 11, 40}}}
#define MAC_COUNTRY_5G_JAPAN      { 12, {'J', 'P', ' '}, {{184, 4, 24}, /**/ { 8, 3, 24}, /**/ { 34,  4, 22}}}

/*
* AUTHENTICATION ALGORITHM
****************************************************************************************
*/
#define MAC_AUTH_ALGO_OPEN                0
#define MAC_AUTH_ALGO_SHARED              1
#define MAC_AUTH_ALGO_FT                  2

#define MAC_AUTH_FIRST_SEQ                1
#define MAC_AUTH_SECOND_SEQ               2
#define MAC_AUTH_THIRD_SEQ                3
#define MAC_AUTH_FOURTH_SEQ               4

// Defines for encryption status
#define MAC_ENC_NONE               0
#define MAC_ENC_WEP                0x01
#define MAC_ENC_WPA                0x02
#define MAC_ENC_TKIP               0x04
#define MAC_ENC_WPA2               0x10
#define MAC_ENC_CCMP               0x20

// MIC and FCS lengths
#define MAC_FCS_LEN     4
#define MAC_MIC_LEN     8

// Key Offsets
#define  MAC_ENC_KEY_OFFSET         0
#define  MAC_AUTHENTICATOR_KEY     16
#define  MAC_SUPPLICANT_KEY        24
#define  MAC_ENC_KEY_LEN           16
#define  MAC_MICHEAL_KEY_LEN        8

/// Maximum size of a beacon frame (default IE + TIM + remaining IE space)
#define MAC_BEACON_SIZE             (102 + MAC_TIM_SIZE + 128)
/// Maximum size of a probe request frame
#define MAC_PROBEREQ_SIZE           100
/// Maximum size of a probe response frame (default IE + remaining IE space)
#define MAC_PROBERSP_SIZE               (102 + 128)
/// Size of a NULL frame
#define MAC_NULL_FRAME_SIZE         MAC_SHORT_MAC_HDR_LEN
/// Size of a QoS-NULL frame
#define MAC_QOS_NULL_FRAME_SIZE     MAC_SHORT_QOS_MAC_HDR_LEN
/// Size of a PS poll
#define MAC_PSPOLL_FRAME_SIZE       MAC_LONG_CTRLFRAME_LEN

/// Structure of a short control frame MAC header
__PACKED struct mac_hdr_ctrl_short
{
    /// Frame control
    uint16_t fctl;
    /// Duration/ID
    uint16_t durid;
    /// Address 1
    struct mac_addr addr1;
} ;

/// Structure of a long control frame MAC header
__PACKED struct mac_hdr_ctrl
{
    /// Frame control
    uint16_t fctl;
    /// Duration/ID
    uint16_t durid;
    /// Address 1
    struct mac_addr addr1;
    /// Address 2
    struct mac_addr addr2;
};

/// Structure of a long control frame MAC header
__PACKED struct mac_hdr
{
    /// Frame control
    uint16_t fctl;
    /// Duration/ID
    uint16_t durid;
    /// Address 1
    struct mac_addr addr1;
    /// Address 2
    struct mac_addr addr2;
    /// Address 3
    struct mac_addr addr3;
    /// Sequence control
    uint16_t seq;
};

/// Structure of a long control frame MAC header
__PACKED struct mac_hdr_qos
{
    /// Frame control
    uint16_t fctl;
    /// Duration/ID
    uint16_t durid;
    /// Address 1
    struct mac_addr addr1;
    /// Address 2
    struct mac_addr addr2;
    /// Address 3
    struct mac_addr addr3;
    /// Sequence control
    uint16_t seq;
    /// QoS control
    uint16_t qos;
};

/// Structure of a long control frame MAC header
__PACKED struct mac_hdr_long
{
    /// Frame control
    uint16_t fctl;
    /// Duration/ID
    uint16_t durid;
    /// Address 1
    struct mac_addr addr1;
    /// Address 2
    struct mac_addr addr2;
    /// Address 3
    struct mac_addr addr3;
    /// Sequence control
    uint16_t seq;
    /// Address 4
    struct mac_addr addr4;
};

/// Structure of a long control frame MAC header
__PACKED struct mac_hdr_long_qos
{
    /// Frame control
    uint16_t fctl;
    /// Duration/ID
    uint16_t durid;
    /// Address 1
    struct mac_addr addr1;
    /// Address 2
    struct mac_addr addr2;
    /// Address 3
    struct mac_addr addr3;
    /// Sequence control
    uint16_t seq;
    /// Address 4
    struct mac_addr addr4;
    /// QoS control
    uint16_t qos;
};

/// Structure of Ethernet Header
__PACKED struct ethernet_hdr
{
    // Destination Address
    struct mac_addr da;
    // Source Address
    struct mac_addr sa;
    // Length / Type
    uint16_t len;
};

/// Structure of a Beacon or ProbeRsp frame
__PACKED struct bcn_frame
{
    /// MAC Header
    struct mac_hdr h;
    /// Timestamp
    uint64_t tsf;
    /// Beacon interval
    uint16_t bcnint;
    /// Capability information
    uint16_t capa;
    /// Rest of the payload
    uint8_t variable[];
};

/// Structure of a Probe Request frame
__PACKED struct preq_frame
{
    /// MAC Header
    struct mac_hdr h;
    /// Rest of the payload
    uint8_t payload[];
};

/// Structure of a Block Acknowledgment Request frame
struct bar_frame
{
    /// MAC Header
    struct mac_hdr_ctrl h;
    /// BAR control
    uint16_t bar_cntrl;
    /// BAR information
    uint16_t bar_information;
};

/// Structure of a Block Acknowledgment frame
__PACKED struct ba_frame
{
    /// MAC Header
    struct mac_hdr_ctrl h;
    /// BA control
    uint16_t ba_cntrl;
    /// BA Start Sequence Control
    uint16_t ssc;
    /// BA bitmap
    uint16_t bitmap[4];
};

/// Structure of A-MSDU Header
__PACKED struct amsdu_hdr
{
    // Destination Address
    struct mac_addr da;
    // Source Address
    struct mac_addr sa;
    // Length
    uint16_t len;
} ;

///Payload length of the BAR frame
#define BAR_PAYLOAD_LEN        (sizeof_b(struct bar_frame))
///Byte length of the BAR frame, including FCS
#define BAR_FRM_LEN_WITH_FCS   (BAR_PAYLOAD_LEN + MAC_FCS_LEN)

///BAR frame body BAR Control field
#define BAR_CNTL_ACK_TYPE_BIT    CO_BIT(0)
#define BAR_CNTL_MULTI_TID_BIT   CO_BIT(1)
#define BAR_CNTL_COMPRESSED_BIT  CO_BIT(2)

#define BAR_CNTL_TID_OFT         12
#define BAR_CNTL_TID_MSK         (0xF<<BAR_CNTL_TID_OFT)

/// Compressed BlockAck frame length
#define BA_FRM_LEN               (sizeof_b(struct ba_frame))





/// @} end of group
#endif // _MAC_FRAME_H_
